In [1]:
import pandas as pd
import requests
import json
import getpass

In [2]:
#Import country_codes CSV file that contains all the country codes from WeatherBit
country_codes_OECD = pd.read_csv('country_codes_OECD.csv', engine='python')

In [3]:
country_codes_OECD.head()

   code      country  Unnamed: 2 Unnamed: 3
0   ABW        Aruba         NaN        NaN
1   AFG  Afghanistan         NaN        NaN
2  AFRI       Africa         NaN        NaN
3   AGO       Angola         NaN        NaN
4   AIA     Anguilla         NaN        NaN

In [4]:
#Remove whitespaces from column names
country_codes_OECD.columns = country_codes_OECD.columns.str.replace(' ','')

In [5]:
#Look at shape of the dataframe
country_codes_OECD.shape

(234, 4)

In [6]:
#Investigate null values
country_codes_OECD.isna().sum()

code           0
country        0
Unnamed:2    234
Unnamed:3    233
dtype: int64

In [7]:
#Column 'Unnamed:2' can be dropped
country_codes_OECD = country_codes_OECD.drop(['Unnamed:2'], axis=1)

In [8]:
#Investigate the solitary non-null value in 'Unnamed:3' column
country_codes_OECD.groupby(by=["Unnamed:3"]).sum()

          code   country
Unnamed:3
Ukraine    VAT  Holy See

In [9]:
#Column 'Unnamed:3' can be dropped
country_codes_OECD = country_codes_OECD.drop(['Unnamed:3'], axis=1)

In [10]:
#Export data to CSV file
country_codes_OECD = country_codes_OECD.to_csv('country_codes_final.csv', index=False)

In [11]:
#Import and clean 'protected_areas' CSV file

In [12]:
protected_areas = pd.read_csv('protected_areas.csv')

In [13]:
protected_areas.head()

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,PROTECTEDAREA,TERREST,PC_LANDAREA,A,2015,18.14,NaN
1,AUS,PROTECTEDAREA,TERREST,PC_LANDAREA,A,2016,18.85,NaN
2,AUS,PROTECTEDAREA,TERREST,PC_LANDAREA,A,2017,19.10,NaN
3,AUS,PROTECTEDAREA,TERREST,PC_LANDAREA,A,2018,19.20,NaN
4,AUS,PROTECTEDAREA,TERREST,PC_LANDAREA,A,2019,19.20,NaN

In [14]:
#Investigate null values
protected_areas.isna().sum()

LOCATION        0
INDICATOR       0
SUBJECT         0
MEASURE         0
FREQUENCY       0
TIME            0
Value           0
Flag Codes    438
dtype: int64

In [15]:
#Delete 'Flag Codes' column
protected_areas.drop('Flag Codes', axis=1, inplace=True)

In [16]:
#Check for columns that have only one unique value, and drop columns that do
for col in protected_areas.columns:
    if len(protected_areas[col].unique()) == 1:
        protected_areas.drop(col, axis=1, inplace=True)

In [17]:
protected_areas

    LOCATION  TIME  Value
0        AUS  2015  18.14
1        AUS  2016  18.85
2        AUS  2017  19.10
3        AUS  2018  19.20
4        AUS  2019  19.20
..       ...   ...    ...
433      URY  2016   3.48
434      URY  2017   3.48
435      URY  2018   3.48
436      URY  2019   3.62
437      URY  2020   3.62

[438 rows x 3 columns]

In [18]:
#Use pivot function to create new columns for each year in the dataframe
protected_areas = protected_areas.pivot(index='LOCATION', columns='TIME')
protected_areas.head()

          Value
TIME       2015   2016   2017   2018   2019   2020
LOCATION
ARG        8.27   8.29   8.33   8.39   8.39   8.39
ARM       24.11  24.11  24.11  24.11  24.11  24.11
AUS       18.14  18.85  19.10  19.20  19.20  19.20
AUT       27.97  28.45  28.45  28.54  28.54  28.54
AZE        5.63   5.63   5.63   5.93   5.93   5.93

In [19]:
#Reintroduce index, moving country codes into the dataframe
protected_areas.reset_index(inplace=True)

In [20]:
protected_areas.head()

     LOCATION  Value
TIME            2015   2016   2017   2018   2019   2020
0         ARG   8.27   8.29   8.33   8.39   8.39   8.39
1         ARM  24.11  24.11  24.11  24.11  24.11  24.11
2         AUS  18.14  18.85  19.10  19.20  19.20  19.20
3         AUT  27.97  28.45  28.45  28.54  28.54  28.54
4         AZE   5.63   5.63   5.63   5.93   5.93   5.93

In [21]:
protected_areas.columns

MultiIndex([('LOCATION',   ''),
            (   'Value', 2015),
            (   'Value', 2016),
            (   'Value', 2017),
            (   'Value', 2018),
            (   'Value', 2019),
            (   'Value', 2020)],
           names=[None, 'TIME'])

In [22]:
#Remove multiindex
[x for x in protected_areas.columns]

[('LOCATION', ''),
 ('Value', 2015),
 ('Value', 2016),
 ('Value', 2017),
 ('Value', 2018),
 ('Value', 2019),
 ('Value', 2020)]

In [23]:
[x[1] for x in protected_areas.columns]

['', 2015, 2016, 2017, 2018, 2019, 2020]

In [24]:
protected_areas.columns = [x[1] for x in protected_areas.columns]

In [26]:
#Rename column containing country codes
protected_areas.rename(columns={ protected_areas.columns[0]: "country_code" }, inplace = True)

In [27]:
protected_areas.head()

  country_code   2015   2016   2017   2018   2019   2020
0          ARG   8.27   8.29   8.33   8.39   8.39   8.39
1          ARM  24.11  24.11  24.11  24.11  24.11  24.11
2          AUS  18.14  18.85  19.10  19.20  19.20  19.20
3          AUT  27.97  28.45  28.45  28.54  28.54  28.54
4          AZE   5.63   5.63   5.63   5.93   5.93   5.93

In [29]:
protected_areas = protected_areas.to_csv('protected_areas.csv', index=False)